tap "alienator88/cask"
tap "banh-canh/ytui"
tap "bloznelis/tap"
tap "espanso/espanso"
tap "felixkratz/formulae"
tap "glinford/tap"
tap "hashicorp/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "keith/formulae"
tap "koekeishiya/formulae"
tap "marsanne/cask"
tap "nikitabobko/tap"
tap "nikolaeu/numi"
tap "zfdang/free-for-macos"
brew "age"
brew "xz"
brew "openssl@3"
brew "asciiquarium"
brew "atuin"
brew "automake"
brew "bash"
brew "bat"
brew "bettercap"
brew "bison"
brew "blueutil"
brew "btop"
brew "cbonsai"
brew "readline"
brew "python@3.13"
brew "chruby"
brew "cli11"
brew "cmake"
brew "docker", link: false
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "pkgconf"
brew "htop"
brew "ifstat"
brew "imap-uw"
brew "iproute2mac"
brew "jq"
brew "lazydocker"
brew "lf"
brew "libffi"
brew "libiconv"
brew "libyaml"
brew "lmdb"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "mpv"
brew "nano"
brew "neovim"
brew "nmap"
brew "node"
brew "notmuch"
brew "nowplaying-cli"
brew "openssh"
brew "openvpn"
brew "php"
brew "pngpaste"
brew "pnpm"
brew "podman"
brew "portal"
brew "procs"
brew "ranger"
brew "ripgrep"
brew "ruby-install"
brew "sesh"
brew "speedtest-cli"
brew "spotify_player"
brew "sshs"
brew "starship"
brew "stow"
brew "stylua"
brew "superfile"
brew "switchaudio-osx"
brew "tailscale"
brew "wireshark"
brew "termshark"
brew "tldr"
brew "tmux"
brew "tokyo-cabinet"
brew "trash"
brew "trash-cli"
brew "tree"
brew "unar"
brew "unzip"
brew "uv"
brew "wget"
brew "wifi-password"
brew "wordnet"
brew "wtfis"
brew "xclip"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "bloznelis/tap/kbt"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"
brew "jstkdng/programs/ueberzugpp"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "nikolaeu/numi/numi-cli"
brew "zfdang/free-for-macos/free-for-macos"
cask "1password"
cask "1password-cli"
cask "activitywatch"
cask "aerospace"
cask "alt-tab"
cask "arc"
cask "brave-browser"
cask "chatgpt"
cask "cleanshot"
cask "cloudflare-warp"
cask "daisydisk"
cask "dns-easy-switcher"
cask "drawio"
cask "espanso"
cask "firefox@nightly"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "ghostty"
cask "iina"
cask "karabiner-elements"
cask "keka"
cask "kitty"
cask "knockknock"
cask "latest"
cask "leader-key"
cask "legcord"
cask "little-snitch"
cask "lunar"
cask "maccy"
cask "melonds"
cask "middleclick"
cask "mimestream"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "pearcleaner"
cask "pictogram"
cask "protonvpn"
cask "qbittorrent"
cask "raindropio"
cask "raycast"
cask "sf-symbols"
cask "spotify"
cask "utm"
cask "virustotal"
cask "vivaldi"
cask "webtorrent"
cask "wezterm"
cask "zen-browser"
mas "Classic Loan Calculator", id: 6743346144
mas "clipyboard", id: 6738871678
mas "Color Picker", id: 1545870783
mas "Countdown", id: 6744842468
mas "Kulve", id: 6476389316
mas "PDFgear", id: 6469021132
